<template>
  <div class="privacy-policy">
    <h1>개인정보처리방침</h1>
    <p>
      헬스캐처(이하 회사)는 이용자의 개인정보를 매우 중요하게 생각하며 개인정보보호법 등 관련 법령에 따라 안전하고 적법하게 처리하고 있습니다.
      이용자 개인 정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
      회사는 개인정보처리방침을 개정하는 경우 헬스올라 어플리케이션 공지사항(또는 개별공지)을 통하여 공지할 것입니다.
      본 방침은 2025년 1월 1일부터 시행됩니다.
    </p>
    <h2>1. 개인정보 수집 항목 및 수집 방법</h2>
    <p>회사는 서비스 운영을 위해 아래의 고객 개인정보를 수집하고 있습니다.</p>
    <p>
      가. 홈페이지 회원가입 및 관리
      회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.
      (수집항목 : 로그인ID, 생년월일, 휴대전화번호, 이름, 성별, 나이, 이메일주소, 비밀번호)
    </p>
    <p>
      나. 민원사무 처리
      민원인의 신원 확인, 민원사항 확인, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.
      (수집항목 : 이메일, 이름, 휴대전화번호)
    </p>
    <p>
      다. 재화 또는 서비스 제공
      물품배송, 서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증, 요금결제·정산 등을 목적으로 개인정보를 처리합니다.
      (수집항목 : 자택주소, 전화번호, 휴대전화번호, 이동통신사, 이름, 이메일, 신용카드정보, 은행계좌정보, 주민등록번호)
    </p>
    <p>
      라. 마케팅 및 광고에의 활용
      신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공 , 인구통계학적 특성에 따른 서비스 제공 및 광고 게재 , 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계
      등을 목적으로 개인정보를 처리합니다.
      (수집항목 : 거주지역, 결혼여부, 기타 설문응답내용)
    </p>
    <p>
      마. 서비스의 원활한 이용
      서비스 이용과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.
      (수집항목 : 접속IP, 쿠키, 방문일시, 서비스 이용기록, 불량 이용기록)
    </p>
    <p>
      바. 개인정보의 수집 방법
      홈페이지 및 모바일 어플리케이션 회원가입, 캠페인행사 및 이벤트 응모, 구매 및 배송 요청, 설문조사
    </p>
    <h2>2. 개인정보 수집목적 및 이용목적</h2>
    <p>
      회사는 아래와 같은 목적으로 서비스 제공을 위한 최소한의 개인정보만을 수집합니다.
      • 광고주가 회사의 서비스에 대한 상담 요청시, 원할한 상담을 위하여 개인정보를 이용합니다.
      • 광고주 등록 의사 확인, 연령 확인 및 법정대리인 동의 진행, 이용자 및 법정대리인의 본인 확인, 이용자 식별, 광고주 탈퇴 의사의 확인 등 광고주 회원 관리를 위하여 개인정보를 이용합니다.
      • 법령 및 광고주 이용약관을 위반하는 광고주 회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의 원활한 운영에 지장을 주는 행위에 대한 방지 및 제재, 계정도용 및 부정거래 방지, 약관
      개정 등의 고지사항 전달, 분쟁조정을 위한 기록 보존, 민원처리 등 이용자 보호 및 서비스 운영을 위하여 개인정보를 이용합니다.
      • 이용 중인 서비스 관련 정보(캠페인 진행 현황, 캠페인 결과보고서 등)을 이메일 및 문자 등으로 안내하기 위하여 개인정보를 이용합니다.
      • 인구통계학적 분석, 서비스 방문 및 이용기록의 분석, 관심사 등에 기반한 맞춤형 서비스 제공 등 신규 서비스 요소의 발굴 및 기존 서비스 개선 등을 위하여 개인정보를 이용합니다.
      • 이벤트 정보 및 참여기회 제공, 광고성 정보 제공 등 마케팅 및 프로모션 목적으로 개인정보를 이용합니다.
      회사는 수집한 정보를 위 목적 외로 사용하거나 이용자의 동의 없이 외부에 공개하지 않습니다.
    </p>
    <h2>3. 개인정보의 처리 및 보유 기간</h2>
    <p>
      회사는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리 및 보유합니다.
    </p>
    <p>
      (1) 회사 내부 방침에 의한 정보보유 사유
    </p>
    <p>
      가. 부정이용기록
      보존 항목 : 이름, 휴대전화번호, 이메일주소, IP, 로그 기록
      보존 이유 : 부정 이용 방지
      보존 기간 : 1년
    </p>
    <p>

      (2) 관련법령에 의한 정보보유 사유
      상법, 전자상거래 등에서의 소비자보호에 관한 법률 등 관계법령의 규정에 의하여 보존할 필요가 있는 경우 회사는 관계법령에서 정한 일정한 기간 동안 회원정보를 보관합니다.
      이 경우 회사는 보관하는 정보를 그 보관의 목적으로만 이용하며 보존기간은 아래와 같습니다.
    </p>
    <p>
      가. 웹사이트 방문기록
      보존 이유 : 통신비밀보호법
      보존 기간 : 3개월
    </p>
    <p>
      나. 본인확인에 관한 기록
      보존 이유 : 정보통신망 이용촉진 및 정보보호 등에 관한 법률
      보존 기간 : 6개월
    </p>
    <p>
      다. 소비자의 불만 또는 분쟁처리에 관한 기록
      보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
      보존 기간 : 3년
    </p>
    <p>
      라. 계약 또는 청약철회 등에 관한 기록
      보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
      보존 기간 : 5년
    </p>
    <p>
      마. 대금결제 및 재화 등의 공급에 관한 기록
      보존 이유 : 전자상거래 등에서의 소비자보호에 관한 법률
      보존 기간 : 5년
    </p>

    <h2>4. 개인정보의 제3자 제공에 관한 사항</h2>
    <p>
      회사는 원활한 서비스 제공을 위하여 관련 정보를 필요 범위 내에서 아래 업체에게 제공합니다.
    </p>
    <p>
      가. 제공목적: 본인인증
      제공받는자: 클라이언트
      제공항목: 회원정보(이름, 아이디, 휴대전화번호)
      보유 및 이용기간: 캠페인 종료 후 1개월
    </p>
    <p>
      나. 제공목적: 물품배송
      제공받는자: 클라이언트
      제공항목: 배송정보(이름, 휴대전화번호, 주소)
      보유 및 이용기간: 캠페인 신청 후 3개월
    </p>
    <p>
      회사는 회원의 개인정보를 동의 없이 제3자에게 제공하지 않습니다. 다만, 법령의 규정에 의한 경우는 예외로 합니다.
      이용자가 캠페인에 참여하는 경우, 개인정보를 제공받는 자에 관하여 개별적으로 사전동의를 받습니다.
    </p>

    <h2>5. 개인정보처리 위탁</h2>
    <p>
      회사는 서비스 향상을 위해서 고객님의 개인정보가 필요한 경우 동의 등 법률상의 요건을 구비하여 외부에 수집·처리·관리등을 위탁하여 처리할 수 있으며, 제 3자에게 제공할 수 있습니다.
      회사는 개인정보의 처리와 관련하여 아래와 같이 업무를 위탁하고 있으며, 관계 법령에 따라 위탁계약 시 개인정보가 안전하게 관리될 수 있도록 필요한 사항을 규정하고 있습니다.
      또한 공유하는 정보는 당해 목적을 달성하기 위하여 필요한 최소한의 정보에 국한됩니다.
    </p>
    <p>
      수탁자 위탁범위
      - ‘문자발송업체' SMS발송
      - ‘택배발송업체' 물품 배송 및 청구서 등 발송
      - ‘제휴업체’ 물품 배송 및 청구서 등 발송
    </p>
    <p>
      가. ‘회사’는 위탁계약 체결시 개인정보 보호법 제25조에 따라 위탁업무 수행목적 외 개인정보 처리금지, 기술적․관리적 보호조치, 재위탁 제한, 수탁자에 대한 관리․감독, 손해배상 등 책임에 관한 사항을
      계약서 등 문서에 명시하고, 수탁자가 개인정보를 안전하게 처리하는지를 감독하고 있습니다.
    </p>
    <p>
      나. 위탁업무의 내용이나 수탁자가 변경될 경우에는 지체없이 본 개인정보 처리방침을 통하여 공개하도록 하겠습니다.
    </p>
    <h2>6. 링크사이트 에 대한 책임</h2>
    <p>
      회사는 회원님께 다른 회사의 웹사이트 또는 자료에 대한 링크를 제공할 수 있습니다.
      이 경우 회사는 외부사이트 및 자료에 대한 아무런 통제권이 없으므로 그로부터 제공받는 서비스나 자료의 유용성에 대해 책임질 수 없으며 보증할 수 없습니다.
      회사가 포함하고 있는 링크를 클릭(click)하여 타사이트(site)의 페이지로 옮겨 갈 경우 해당 사이트의 개인정보보호정책은 회사와 무관하므로 새로 방문한 사이트의 정책을 검토해보시기 바랍니다.
    </p>
    <h2>7. 이용자 및 법정대리인의 권리와 그 행사방법</h2>
    <p>
      가. 이용자 및 법정대리인은 언제든지 등록되어 있는 자신 또는 대리자의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.
    </p>
    <p>
      나. 이용자 혹은 대리인의 개인정보 조회, 수정, 가입 해지(동의철회)를 위해서는 bywhang@healthcatcher.net으로 이메일을 발송해서 본인 확인 절차를 거치신 후 열람, 정정 또는 탈퇴가
      가능합니다.
    </p>
    <p>
      다. 혹은 개인정보관리책임자에게 서면 또는 전화로 연락하시면 지체없이 조치하겠습니다.
    </p>
    <p>
      라. 귀하가 개인정보의 오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해 개인정보를 이용 또는 제공하지 않습니다. 또한 잘못된 개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를
      제3자에게 지체없이 통지하여 정정이 이루어지도록 하겠습니다.
    </p>
    <p>
      마. 회사는 이용자의 요청에 의해 해지 또는 삭제된 개인정보는 "회사가 수집하는 개인정보의 보유 및 이용기간"에 명시된 바에 따라 처리하고 그 외의 용도로 열람 또는 이용할 수 없도록 처리하고 있습니다.
    </p>
    <h2>8. 개인정보의 파기절차 및 방법</h2>
    <p>
      가. 파기절차
      회원님이 회원가입 등을 위해 입력하신 정보는 목적이 달성된 후 별도의 DB로 옮겨져(종이의 경우 별도의 서류함) 내부 방침 및 기타 관련 법령에 의한 정보보호 사유에 따라 (보유 및 이용기간 참조) 일정
      기간
      저장된 후 파기되어집니다.
      별도 DB로 옮겨진 개인정보는 법률에 의한 경우가 아니고서는 보유되어지는 이외의 다른 목적으로 이용되지 않습니다.
    </p>
    <p>
      나. 파기방법
      종이에 출력된 개인 정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하거나 전자적 파일형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
    </p>
    <h2>9. 쿠키의 운영 및 수집 거부 방법</h2>
    <p>
    회사는 이용자 개개인에게 개인화되고 맞춤화된 서비스를 제공하기 위해 이용자의 정보를 저장하고 수시로 불러오는 쿠키cookie를 사용합니다.
    </p>
    <p>
    가. 쿠키의 사용 목적
    회원과 비회원의 접속 빈도나 방문 시간 등의 분석 이용자의 취향과 관심분야의 파악 및 자취 추적 각종 캠페인 참여 정도 및 방문 회수 파악 등을 통한 타 겟 마케팅 및 개인 맞춤 서비스 제공합니다.
    </p>
    <p>
    나. 쿠키 설정 거부 방법
    이용자는 쿠키 설치에 대해 거부할 수 있습니다. 단 쿠키 설치를 거부하였을 경우 로그인이 필요한 일부 서비스의 이용이 어려울 수 있습니다.
    </p>
    <p>
    -설정방법IE 기준 웹 브라우저 상단의 도구 > 인터넷 옵션 > 개인정보 > 사이트 차단
    </p>
    <h2>10. 개인정보의 기술적/관리적 보호 대</h2>
    <p>
    회사는 이용자들의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 보호대책을 강구하고 있습니다.
    </p>
    <p>
    가. 개인정보의 암호화
    이용자의 비밀번호는 일방향 암호화하여 저장 및 관리되고 있으며, 개인정보의 확인 및 변경은 비밀번호를 알고 있는 본인에 의해서만 가능합니다. 주민등록번호, 외국인등록번호, 은행계좌번호 등의 개인정보는 안전한
    암호 알고리즘으로 암호화되어 저장 및 관리되고 있습니다.
    </p>
    <p>
    나. 해킹 등에 대비한 대책
    회사는 해킹 등 회사 정보통신망 침입에 의해 이용자의 개인정보가 유출되는 것을 방지하기 위해 침입탐지 및 침입차단 시스템을 24시간 가동하고 있습니다.
    만일의 사태에 대비하여 모든 침입탐지 시스템과 침입차단 시스템은 이중화로 구성하여 운영하고 있으며, 민감한 개인정보는 암호화 통신 등을 통하여 네트워크상에서 개인정보를 안전하게 전송할 수 있도록 하고
    있습니다.
    </p>
    <p>
    다. 개인정보 처리 직원의 최소화 및 교육
    회사는 회사의 개인정보 처리직원을 최소한으로 제한하며, 개인정보 처리직원에 대한 교육 등 관리적 조치를 통해 개인정보보호의 중요성을 인식시키고 있습니다.
    </p>
    <h2>11. 개인정보 보호책임자 작성</h2>
    <p>
      회사는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.
    </p>
    <p>
    ▶ 개인정보 보호책임자
    성명 : 황비연
    연락처 : 010-7799-7360
    이메일 : byhwang@healthcatcher.net
    </p>
    <p>
    가. 귀하게서는 회사의 서비스를 이용하시며 발생하는 모든 개인정보보호 관련 민원을 개인정보관리책임자에게 신고하실 수 있습니다.
    </p>
    <p>
    나. 회사는 이용자들의 신고사항에 대해 신속하게 충분한 답변을 드릴 것입니다.
    </p>
    <p>
    다. 기타 개인정보침해에 대한 신고나 상담이 필요하신 경우에는 아래 기관에 문의하시기 바랍니다.
    </p>
    <p>
    - 개인분쟁조정위원회 (www.1336.or.kr/1336)
    - 정보보호마크인증위원회 (www.eprivacy.or.kr/02-580-0533~4)
    - 대검찰청 인터넷범죄수사센터 (http://icic.sppo.go.kr/02-3480-3600)
    - 경찰청 사이버테러대응센터 (www.ctrc.go.kr/02-392-0330)
    </p>
    <h2>12. 개인정보 처리방침 변경</h2>
    <p>
    이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.
    </p>
    <h3>
    개인정보처리방침 시행일: 2025년 01월 01일
    </h3>
    <!-- 계속해서 나머지 내용을 구조에 맞게 추가합니다. -->
    <!-- 내용이 길기 때문에 섹션 별로 나누고, 각 항목에 대한 자세한 설명을 추가합니다. -->
  </div>
</template>

<script>
import HeroSection from "@/components/HeroSection.vue";

export default {
  name: 'PrivacyPolicy',
  components: {HeroSection},
  data() {
    return {
      sections: [
        {
          title: "개인정보처리방침",
          description: "헬스캐처(이하 회사)는 이용자의 개인정보를 매우 중요하게 생각하며 개인정보보호법 등 관련 법령에 따라 안전하고 적법하게 처리하고 있습니다.\n" +
              "이용자 개인 정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다. 회사는 개인정보처리방침을 개정하는 경우 헬스올라 어플리케이션 공지사항(또는 개별공지)을 통하여 공지할 것입니다. 본 방침은 2025년 1월 1일부터 시행됩니다.\n",
          items: [
            {
              subtitle: "1. 개인정보 수집 항목 및 수집 방법",
              details: "회원 가입의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원자격 유지·관리, 서비스 부정이용 방지, 각종 고지·통지, 고충처리, 분쟁 조정을 위한 기록 보존 등을 목적으로 개인정보를 처리합니다.",
              items: ["로그인ID", "생년월일", "휴대전화번호", "이름", "성별", "나이", "이메일주소", "비밀번호"]
            },
            {
              subtitle: "나. 민원사무 처리",
              details: "민원인의 신원 확인, 민원사항 확인, 처리결과 통보 등을 목적으로 개인정보를 처리합니다.",
              items: ["이메일", "이름", "휴대전화번호"]
            },
            {
              subtitle: "다. 재화 또는 서비스 제공",
              details: "물품배송, 서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공, 본인인증, 요금결제·정산 등을 목적으로 개인정보를 처리합니다.",
              items: ["자택주소", "전화번호", "휴대전화번호", "이동통신사", "이름", "이메일", "신용카드정보", "은행계좌정보", "주민등록번호"]
            },
            {
              subtitle: "라. 마케팅 및 광고에의 활용",
              details: "신규 서비스(제품) 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공 및 참여기회 제공, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.",
              items: ["거주지역", "결혼여부", "기타 설문응답내용"]
            },
            {
              subtitle: "마. 서비스의 원활한 이용",
              details: "서비스 이용과정에서 아래와 같은 정보들이 자동으로 생성되어 수집될 수 있습니다.",
              items: ["접속IP", "쿠키", "방문일시", "서비스 이용기록", "불량 이용기록"]
            },
            {
              subtitle: "바. 개인정보의 수집 방법",
              details: "개인정보 수집 방법에는 다음과 같은 방법이 포함됩니다.",
              items: ["홈페이지 및 모바일 어플리케이션 회원가입", "캠페인행사 및 이벤트 응모", "구매 및 배송 요청", "설문조사"]
            }
          ]
        }
      ]
    };
  }
}
</script>

<style scoped>
.privacy-policy {
  font-family: 'Arial', sans-serif;
  line-height: 1.6;
  padding: 20px;
  max-width: 800px;
  margin: 0 auto;
  padding-top: 100px;
}

.hero {
  position: relative;
  height: 50vh;
  display: flex;
  justify-content: center;
  align-items: center;
  background-color: rgba(0, 0, 0, 0.5);
}

h1 {
  color: #333;
  text-align: center;
  margin-bottom: 20px;
}

h2 {
  border-bottom: 1px solid #ddd;
  padding-bottom: 5px;
  color: #666;
}

p, ul, li {
  font-size: 14px;
  color: #555;
}
</style>
